In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [2]:
incidents = pd.Series(data=[14, 334, 312, 5823, 9491, 7486, 4343],
                      index=['do 6', '7-14', '15-17', '18-24', '25-39', '40-59', '60 i więcej'])
incidents

do 6             14
7-14            334
15-17           312
18-24          5823
25-39          9491
40-59          7486
60 i więcej    4343
dtype: int64

In [3]:
incidents.where(incidents > 1000)

do 6              NaN
7-14              NaN
15-17             NaN
18-24          5823.0
25-39          9491.0
40-59          7486.0
60 i więcej    4343.0
dtype: float64

In [4]:
incident1000 = incidents[incidents > 1000]
incident1000

18-24          5823
25-39          9491
40-59          7486
60 i więcej    4343
dtype: int64

In [5]:
incidents

do 6             14
7-14            334
15-17           312
18-24          5823
25-39          9491
40-59          7486
60 i więcej    4343
dtype: int64

In [6]:
incidents.filter(items = ['18-24', '25-39', '40-59'])

18-24    5823
25-39    9491
40-59    7486
dtype: int64

In [7]:
incidents.where(incidents <= 1000, inplace=True)
incidents.dropna(inplace=True)
incidents

do 6      14.0
7-14     334.0
15-17    312.0
dtype: float64